Repository: paullewallencom/drupal-978-1-9048-1180-0
Catalog: _src/modules/flexinode/po/*.po
Languages: da

source: The flexinode module allows administrators to create simple new content types. Administrators find it very useful to create new types of content without having to program a new content module.
da: Flexinodemodulet lader administratorer oprette simple, nye indholdstyper. Administratorer finder det nyttigt at oprette nye indholdstyper uden at skulle programmere et nyt indholdsmodul.

source: When creating a new flexinode, administrators are presented with a flexinode form to create their new content type. Once administrators have created their flexinode they can accept the format or choose to theme the content type to change it's presentation. For users, creating content that is a flexinode is just like adding other content. The flexinode content type will show up alongside all normal content.
da: Når en ny flexinode oprettes, præsenteres adminstratorer for en flexinodeformular hvor de kan oprette den nye indholdstype. Når administratorer har oprettet en flexinode kan de acceptere det givne format eller vælge ændre præsentation af indholdstypen med et tema. Brugere opretter flexinodeindhold på samme måde som andet indhold. Flexinode indholdstypen vises på linje med normalt indhold.

source: <p>You can</p> <ul> <li>create a flexinode content type at <a href="%admin-node-types" title="administer content types to add a flexinode"> administer &gt;&gt; content &gt;&gt; content types</a> and select <strong>add content type</strong>.</li> <li><a href="%node-add" title="create a new flexinode type">create content &gt;&gt; add type.</a></li> <li>administer flexinode at <a href="%admin-settings-flexinode">administer &gt;&gt; settings &gt;&gt; flexinode</a>.</li>
da: <p>Du kan</p> <ul> <li>oprette en flexinode indholdstype: <a href="%admin-node-types" title="administrer indholdstyper for at tilføje en flexinode">administration &gt;&gt; indhold &gt;&gt; indholdstyper</a>, vælg <strong>tilføj indholdstype</strong>.</li> <li><a href="%node-add" title="opret en ny flexinode">Opret indhold &gt;&gt; tilføj type</a></li> <li>Administrere flexinode: <a href="%admin-settings-flexinode">administration &gt;&gt; indstillinger &gt;&gt; flexinode</a>.</li> </ul>

source: For more information please read the configuration and customization handbook <a href="%flexinode">Flexinode page</a>.
da: Læs siden om <a href="%page">flexinode</a> i håndbogen om konfiguration og tilpasning for yderligere information.

source: Allows administrators to define their own content types.
da: Administratorer kan definere deres egne indholdstyper.

source: You may manage your own content types here. These will all have a "title" field to start off, and contain additional fields that you specify. Choose the "add content type" tab to add a new type. Make a selection below to edit an existing type or field. To delete a field or entire content type, first open the editing form for that field or type.
da: Her kan du definere dine egne indholdstyper. De vil alle starte med feltet "titel" og vil indeholde de felter du tilføjer. Vælg "tilføj indholdstype" for at tilføje en ny type. Foretag et valg herunder for at redigere en eksisterende type eller et eksisterende felt. For at slette et felt eller en indholdstype skal du først åbne det pågældende felt eller type.

source: Once you create a content type here you will be able to add additional fields to it on the "content types" tab.
da: Når du har oprettet en indholdstype her, kan du tilføje yderligere felter under fanen "indholdstyper".

source: Number of posts in flexinode listings
da: Antal indlæg i flexinodeoversigter

source: Number of posts to show on flexinode listing pages.
da: Antal indlæg der vises i flexinodeoversigter.

source: edit this %nodename
da: rediger denne %nodename

source: list view
da: listevisning

source: tabular view
da: tabelvisning

source: rss feed
da: rss str'm

source: content types
da: indholdstyper

source: add content type
da: tilføj indholdstype

source: delete content type
da: slet indholdstype

source: edit fields
da: rediger felter

source: update
da: opdater

source: title
da: titel

source: %type search results
da: %type resultater

source: Your search yielded no results
da: Din søgning gav ingen resultater

source: feed
da: strøm

source: edit content type
da: rediger indholdstype

source: settings
da: indstillinger

source: edit field
da: rediger felt

source: No flexinode content types have been defined. You can <a href="%url">add a new content type</a>.
da: Ingen flexinode indholdstyper defineret. Du kan <a href="%url">tilføje en ny indholdstype</a>.

source: Add field
da: Tilføj felt

source: Confirm
da: Bekræft

source: Delete
da: Slet

source: More
da: Flere

source: flexible content
da: fleksibelt indhold

source: Title
da: Titel

source: Content type name
da: Indholdstypens navn

source: Description
da: Beskrivelse

source: A one-line description of the content type.
da: En kort beskrivelse af indholdstypen.

source: Help text
da: Hjælp

source: Instructions to present to the user when adding new content of this type.
da: Instruktioner, der vises til brugeren, når nyt indhold af denne type tilføjes.

source: Submit
da: Indsend

source: You must give this content type a name.
da: Du skal navngive indholdstypen.

source: updated content type "%name".
da: indholdstype "%name" opdateret

source: created new content type "%name".
da: indholdstype "%name" oprettet

source: Are you sure you want to delete the content type "%name"? All nodes of this type will be lost.
da: Ønsker du at slette indholdstypen "%name"? Alle indholdselementer af denne type vil gå tabt.

source: deleted content type
da: slettet indholdstype

source: Field label
da: felt etiket

source: A brief description of the field, to be displayed on the content submission form.
da: En kort beskrivelse af feltet, der vises når nyt indhold oprettes.

source: Required field
da: Påkrævet felt

source: Whether the user must fill in the field when creating content.
da: Skal brugeren udfylde feltet når nyt indhold oprettes.

source: Show in teaser
da: Vis i sammendrag

source: Whether this field should be shown as part of the teaser.
da: Skal feltet vises som en del af sammendraget.

source: Show in table
da: Vis i tabel

source: Whether this field should be shown as part of this content type's <a href="%table">tabular view</a>.
da: Skal feltet vises i indholdstypens <a href="%table">tabelvisning</a>.

source: Weight
da: Vægt

source: Optional. On the content editing form, the heavier fields will sink and the lighter fields will be positioned nearer the top.
da: Valgfri. Når nyt indhold tilføjes vil tunge felter synke ned og lette felter blive vist i toppen.

source: You must give this field type a label.
da: Du skal angive en etiket for denne felttype.

source: You must give this field a label.
da: Du skal angive en etiket.

source: add %fieldtype
da: tilføj %fieldtype

source: updated field "%name".
da: felt "%name" opdateret

source: created new field "%name".
da: felt "%name" oprettet

source: Are you sure you want to delete field "%name"? All data in this field will be lost.
da: Ønsker du at slette feltet "%name"? Alle data i feltet vil gå tabt.

source: deleted field %name
da: felt %name slettet

source: Field list
da: Feltliste
