Repository: paullewallencom/drupal-978-1-9048-1180-0
Catalog: _src/modules/flexinode/po/flexinode-*.po
Languages: it, nl

source: <h3>Background</h3> <p>This version of event module implements the drupal nodeapi system. There is no native event node type as in versions previous to 4.6, but instead node types can be 'event-enabled' through the %configure-link, the same way in which file attachments are assigned to node types with upload.module. This, combined with the dynamic content type functionality of %flexinode-link, make it possible to define almost any kind of calendar.</p> <p>Node types can be assigned to general calendar views, or only on their own calendar. For example, this makes it possible to have a general calendar which shows all 'meetups' and 'house parties' in the same place, but perhaps have a separate calendar for 'rallies' which only contains that type. The ability to filter calendar views by node type and taxonomy is also implemented, which allows many different possibilities for displaying content in the calendar system.</p> <h3><a id="url-format"></a>Calendar display url formats</h3> The ability to filter calendar views by content type and taxonomy enables almost unlimited possibilities for displaying content with the calendar system. You can combine taxonomy and content type filters, the url construction scheme is currently as follows: <blockquote> ?q=event/$year/$month/$day/$view_type/$content_type/$taxonomy_terms/$duration<br /><br /> <strong>$year:</strong> year value such as '2005'<br /> <strong>$month:</strong> month value with leading zeroes such as '02' for february<br /> <strong>$day:</strong> day value with leading zeroes such as '14'<br /> <strong>$view_type:</strong> type of calendar layout, values may include 'month', 'week', 'day', and 'table'<br /> <strong>$content_type:</strong> list of node types, separated by '+'. Flexinode types only require the integer value of the type. For example, to view story nodes and type flexinode-1, you would use 'story+1'. The value 'all' will show all types.<br /> <strong>$taxonomy_terms:</strong> list of term ids, seperated by '+'. For example to view entries assigned to the taxonomy terms with ids 4 and 9 you would use '4+9'. The value 'all' will show all terms.<br /> <strong>$duration:</strong> number of days to display, currently only the table view obeys this setting. Eventually it may be used to specify additional duration parameters such as multiple weeks in the week view, or months in the month view. </blockquote> <p>There are url wrapper functions as well, which make it possible to easily create menu items to calendars by event type or taxonomy terms. This is necessary if you wish to create a link to a calendar but do not have a way to dynamically create the url based on the date, like in the menu or in a post.</p> <p>For links to a taxonomy filtered calendar the format is: <blockquote> ?q=event/term/$taxonomy_terms<br /><br /> <strong>$taxonomy_terms:</strong> list of term ids, seperated by '+'. For example to view entries assigned to the taxonomy terms with ids 4 and 9 you would use '4+9'<br /> </blockquote> For links to a content type filtered calendar the format is: <blockquote> ?q=event/type/$content_type<br /><br /> <strong>$content_type:</strong> list of node types, separated by '+'. Flexinode types only require the integer value of the type. For example, to view story nodes and type flexinode-1, you would use 'story+1' </blockquote></p>
it: <h3>Background</h3> <p>Questa versione del modulo evento implementa il sistema nodeapi di Drupal. Non esiste un tipo nodo evento nativo, come nelle versioni precedenti alla 4.6; invece, i tipi di nodi possono essere 'abilitati come eventi' attraverso il %configure-link, nello stesso modo in cui i file allegati vengono assegnati ai tipi di nodi nel modulo upload. Questo, combinato con la funzionalità di tipo contenuto dinamico di %flexinode-link, rendendo possibile definire qualsiasi tipo di calendario.</p> <p>Tipi di nodi possono essere assegnati a viste calendario generali, o solamente ai propri calendari. Per esempio, questo rende possibile avere un calendario generale che mostra tutte le 'riunioni' e le 'feste' insieme, ma avere un calendario generale per i 'rally' che contenga solo quel tipo. E'anche implementata la possibilità di filtrare le viste calendario per tipo nodo e categoria, che permette diverse possibilità per visualizzare contenuti nel sistema di calendari.</p> <h3><a id="url-format"></a>Formati url per la visualizzazione calendari</h3> La possibilità di filtrare viste calendario per tipo contenuto e categoria permette infinite possibilità per visualizzare contenuti con il sistema calendario.Puoi combinare filtri categorie e e tipi contenuto, lo schema di costruzione url è attualmente come segue: <blockquote> ?q=event/$anno/$mese/$giorno/$tipo_vista/$tipo_contenuto/$termini_categorie/$durata<br /><br /> <strong>$anno:</strong> valore anno, ad es. '2005'<br /> <strong>$mese:</strong> valore mese a due cifre, ad es. '02' per febbraio<br /> <strong>$giorno:</strong> valor giorno a due cifre, ad esempio '14'<br /> <strong>$tipo_vista:</strong> tipo di vista calendario, i valori possono essere 'month', 'week', 'day', e 'table'<br /> <strong>$tipo_contenuto:</strong> lista di tipi di nodo, separata da '+'. I tipi nodo creati con il modulo Flexinode richiedono solo il valore intero del tipo. Per esempio, per visualizzare nodi di tipo 'story' e 'flexinode-1', userai 'story+1'. Il valore 'all' mostrerà tutti i tipi.<br /> <strong>$termini_categorie:</strong> lista di termini, separati da '+'. Per esempio per visualizzare eventi assegnati alle categorie i cui termini sono identificati da 4 e 9, userai '4+9'. Il valore 'all' mostrerà tutti i termini.<br /> <strong>$durata:</strong> numero di giorni da visualizzare; attualmente solo la vista tabellare usa questo parametro. Eventualmente, può essere usato per specificare parametri di durata addizionali, come il numero di settimane nella vista settimanale o il numero di mesi nella vista mensile. </blockquote> <p>Cisono anche funzioni che rendono possibile creare facilmente elementi di menu che puntino a calendari per tipo di evento o per termini di categorie. Questo è necessario se vuoi creare un link ad un calendario ma non hai modo di creare dinamicamente l'url basato sulla data, come nel menu o nella visualizzazione di un contenuto pubblicato.</p> <p>Per links ad un calendario filtrato per categorie il formato è: <blockquote> ?q=event/term/$termini_categorie<br /><br /> <strong>$termini_categorie:</strong> lista di tutti i termini, separati da '+'. Per esempio per visualizzare tutte gli eventi assegnati ai termini identificati da 4 e 9, userai '4+9'<br /> </blockquote> Per links a calendari filtrati per tipo di contenuto il formato è: <blockquote> ?q=event/type/$tipo_contenuto<br /><br /> <strong>$tipo_contenuto:</strong> lista di tipi di nodo, separati da '+'. Tipi definiti dal modulo Flexinode richiedono solo la parte intera del tipo. Per esempio, per visualizzare nodi di tipo 'story' e 'flexinode-1', userai 'story+1' </blockquote></p>

source: content type management admin area
it: area di amministrazione delle tipologie di contenuti

source: 1 minute
it: 1 minuto

source: 1 hour
it: 1 ora

source: 1 day
it: 1 giorno

source: event
it: evento

source: limit view to events of this type
it: limite visualizzazione ad eventi di questo tipo

source: view this event
it: visualizza questo evento

source: create %type
nl: %type maken

source: You must fill in this field.
nl: Dit veld verplicht invullen.

source: Flexible content types
nl: Flexibele inhoud types

source: add text field
nl: voeg een tekstveld toe

source: add text area
nl: voeg een tekstgebied toe

source: add dropdown menu
nl: Voeg een uitschuifmenu toe

source: add checkbox
nl: Voeg een checkbox toe

source: add date/time
nl: Voeg datum en of tijd toe

source: add file
nl: voeg een bestand toe

source: add image
nl: Voeg een afbeelding toe

source: updated content type '%name'.
nl: ge-update inhoud type '%name'.

source: created new content type '%name'.
nl: nieuwe inhoud gemaakt van het type '%name'.

source: Delete content type '%name'
nl: Verwijder inhoud type '%name'

source: deleted content type '%name'.
nl: verwijder inhouds type '%name'.

source: updated field '%name'.
nl: update veld '%name'.

source: created new field '%name'.
nl: een nieuw veld '%name' is gecreëerd.

source: Delete field '%name'
nl: Verwijder veld '%name'

source: deleted field '%name'.
nl: het veld '%name' is verwijderd.

source: No
nl: Nee

source: Options for the dropdown menu. For more fields, click 'More'.
nl: Opties van het uitschuifmenu. Voor meer velden, klik op 'Meer'.
