Repository: paullewallencom/drupal-978-1-9048-1180-0
Catalog: _src/modules/flexinode/po/flexinode-*.po
Languages: it, nl

source: Yes
it: Si
nl: Ja

source: Any
it: Qualsiasi
nl: Willekeurig

source: Checked by default
it: Impostato per default
nl: Standaard aangekruist

source: e-mail address
it: indirizzo e-mail

source: The email address is not valid.
it: L'indirizzo e-mail non è valido.

source: Default value
it: Valore di default
nl: Standaard waarde

source: "%filename" has been uploaded. If you upload another file, the current file will be replaced.
it: "%filename" è stato caricato. Se caricate un altro file, quello corrente verrà rimpiazzato.
nl: "%filename" is ge-upload. Als u een ander bestand upload wordt het huidige bestand overschreven.

source: image
it: immagine

source: The file is limited to %kbKB and a resolution of %wxh pixels (width x height).
it: Il file è limitato a %knKB e ad una risoluzione di %wxh pixels (width x height).

source: Maximum picture dimensions
it: Dimensioni massime immagine

source: Maximum dimensions for pictures. Format: widthxheight
it: Dimensioni massime per le immagini. Formato: widthxheight

source: Maximum picture size
it: Grandezza massima dell'immagine

source: Maximum picture file size, in kB.
it: Grandezza massima del file di immagine, in kB.

source: Options
it: Opzioni
nl: Opties

source: Options for the image upload.
it: Opzione per il caricamento dell'immagine.

source: Default thumbnail resolution
it: Risoluzione di default delle miniature

source: Default size of thumbnails: format will be the same as original image. Use just one dimension, and put a "x" to specify height. Examples: "100" for width of 100; "x200" for height of 200.
it: Grandezza di default delle miniature: il formato sarà lo stesso dell'immagine originale. Usate solo una dimensione, e mettete un "x" per specificare. Esempi: "100" per una larghezza di 100; "x200" per un'altezza di 200.

source: Imagemagick Convert path
it: Percorso file Convert di Imagemagick

source: Absolute path to ImageMagick convert executable. Include the filename at the end.
it: Percorso assoluto per il programma convert di Imagemagick. Includete il nome file alla fine.

source: Image processing
it: Elaborazione immagine

source: The uploaded file was not a valid image.
it: Il file caricat onon era un immagine valida.

source: The uploaded image is too large; the maximum file size is %num kB.
it: L'immagine caricata è troppo grande; la grandezza massima del file è %num kB.

source: The uploaded image is too large; the maximum dimensions are %nxn pixels.
it: L'immagine caricata è troppo grande; le dimensioni massime sono %nxn pixels.

source: dropdown menu
it: menu a tendina

source: none
it: nessuno
nl: geen

source: More
it: Ancora
nl: Meer

source: Options for the dropdown menu. For more fields, click "More".
it: Opzioni per il menu a tendina. Per altri campi, click "Ancora".

source: text area
it: area testo

source: Lines
it: Linee
nl: Regels

source: How large the text area will be.
it: Quanto sarà grande l'area testo.
nl: Hoe groot het tekstgebied zal zijn.

source: text field
it: campo testo

source: date/time
it: data/ora

source: January
it: Gennaio
nl: Januari

source: February
it: Febbraio
nl: Februari

source: March
it: Marzo
nl: Maart

source: April
it: Aprile

source: May
it: Maggio
nl: Mei

source: June
it: Giugno
nl: Juni

source: July
it: Luglio
nl: Juli

source: August
it: Agosto
nl: Augustus

source: September
it: Settembre

source: October
it: Ottobre
nl: Oktober

source: November
it: Novembre

source: December
it: Dicembre

source: The url is not valid.
it: L' url non è valido.

source: Allows administrators to define their own content types.
it: Permette agli amministratori di definire i propri tipi di contenuto.

source: <p>Flexinode is a module that allows non-programmers to create new node types (flexible content types) in Drupal when their needs are modest. Users can define the fields in the node edit form for their content type, and can either view the nodes as presented by the module or modify the presentation in their theme.</p> <h3>Editing Content Types</h3> <p>The administration pages for this module are located at:<br /> Administration -> Content Management -> Content Types<br /> Click on "add content type" to make a new one. On this page you can set the title of your new content type and some related information.</p> <p>Once you save your new type, you can add new custom fields to it using the links on the overview page. You can add text fields, dropdown menus, check boxes, file uploads, and other input elements. The Title and Description fields are always shown.</p> <h3>Viewing Content</h3> <p>Adding flexible content is just like adding other nodes; pick the appropriate link from the user menu. The node will show up alongside all normal nodes.</p> <h3>Theming Content</h3> <p>Every custom field is set as a property of the node. To create a custom presentation for your new content type, add logic in your theme's node function to switch on the node type and print out the fields in the way you choose. The fields are all named flexinode_n where n is the field ID.</p>
it: <p>Flexinode è un modulo che permette ai non programmatori di definire nuovi tipi di nodi (tipi di contenuto 'flessibili') in Drupal, quando le esigenze sono sufficientemente semplici. Gli utenti possono definire i campi nella maschera di inserimento/modifica del loro tipo di contenuto, e possono vedere i nodi nel modo in cui sono presentati da lmodulo o modificare la presentazione all'interno del tema grafico.</p> <h3>Modifica dei tipi di contenuto</h3> <p>Le pagine di amministrazione per questo modulo si trovano in:<br /> Amministrazione -> Gestione contenuti -> Tipi di contenuto<br /> Cliccate su "aggiungi tipo di contenuto" per crearne uno nuovo. Su questa pagina potete impostare il titolo del vostro nuovo tipo di contenuto ed altre informazioni collegate.</p> <p>Una volta salvato il nuovo tipo, potete aggiungere nuovi campi utente usando i link sulla pagina di panoramica. Potete aggiungere campi di testo, menu a tendina, checkbox, upload di file e altri elementi di input. I campi Titolo e Descrizione sono sempre visualizzati.</p> <h3>Visualizzazione dei contenuti</h3> <p>Aggiungere un contenuto flessibile è come aggiungere altri nodi, scegliete il link appropriato dal menu utente. Il nodo verrà mostrato come tutti gli altri nodi nornali.</p> <h3>Personalizzazione grafica contenuti</h3> <p>Ogni campo utente è una proprietà del nodo. Per creare una presentazione specifica per il vostro tipo di contenuto, aggiungete della logica alle funzioni del nodo che si occupano dei temi grafici in modo che, in base al tipo di nodo, visualizzi i campi nel modo voluto. I campi si chiamano tutti flexinode_n dove n è l'identificativo del campo</p>

source: You may define your own content types here. These will be extensions of the basic "story" node type with additional fields that you specify. Choose "add content type" in the menu to add a new type. Make a selection below to edit an existing type or field. To delete a field or entire content type, first open the editing form for that field or type.
it: Qui puoi definire i tuoi tipi di contenuto. Queste saranno estensioni del tipo di nodo 'story', con campi addizionali che è possibile specificare. Scegli "aggiungi tipo di contenuto" nel menu per aggiungere un nuovo tipo. Seleziona qui sottoper modificare un tipo o un campo esistente. Per cancellare un campo o un intero tipo di contenuto, prima apri la maschera di modifica per quel campo o per quel tipo di contenuto.

source: edit this %nodename
it: modifica questo %nodename
nl: deze %nodename bewerken

source: list view
it: visualizza lista

source: tabular view
it: vista tabellare

source: search
it: ricerca

source: rss feed
it: sorgente rss

source: content types
it: tipi di contenuto
nl: inhoud types

source: list
it: lista

source: add content type
it: aggiungi tipo di contenuto
nl: inhoud type toevoegen

source: edit content type
it: modifica tipo di contenuto
nl: inhoud type bewerken

source: add field
it: aggiungi campo
nl: een veld toevoegen

source: edit field
it: modifica campo
nl: een veld bewerken

source: update
it: modifica

source: Search
it: Ricerca
nl: Zoek

source: search for phrase
it: ricerca frase
nl: zoek de zin

source: search %type
it: ricerca %type
nl: zoek %type

source: title
it: titolo
nl: titel

source: %type search results
it: risultati ricerca %type
nl: %type zoek resultaten

source: Submit
it: Pubblica
nl: Toevoegen

source: Delete
it: Cancella
nl: Verwijderen

source: name
it: nome
nl: naam

source: description
it: descrizione
nl: beschrijving

source: operations
it: operazioni
nl: operaties

source: Title
it: Titolo
nl: Titel

source: add %fieldtype
it: aggiungi %fieldtype

source: flexible content
it: contenuto flessibile
nl: flexiebele inhoud

source: Content type name
it: Nome tipo di contenuto
nl: Inhoud type naam

source: Description
it: Descrizione
nl: Beschrijving

source: A one-line description of the content type.
it: La descrizione su una sola linea
nl: Een één regelige beschrijving van het inhouds type.

source: Help text
it: Testo aiuto
nl: Help tekst

source: Instructions to present to the user when adding new content of this type.
it: Istruzioni da presentare all'utente quando aggiunge nuovi contenuti di questo tipo.
nl: Instructies voor gebruikers die nieuwe inhoud van dit type willen toevoegen

source: You must give this content type a name.
it: Dovete assegnare un nome a questo contenuto.
nl: U moet dit inhouds type een naam geven.

source: updated content type "%name".
it: contenuto di tipo "%name" modificato.

source: created new content type "%name".
it: nuovo contenuto di tipo "%name" creato.

source: Cancel
it: Annulla
nl: Annuleren

source: Delete content type "%name"
it: Cancella tipo di contenuto "%name"

source: Are you sure you want to delete the content type? All nodes created using this content type will be lost.
it: Siete sicuri di volere cancellare il tipo di contenuto? Tutti i nodi creati usando questo contenuto saranno eliminati.
nl: Wilt u zeker dit inhouds type verwijderen? All nodes die gemaakt zijn met dit inhouds type gaan dan verloren.

source: deleted content type "%name".
it: cancellato tipo di contenuto "%name".

source: Field label
it: Etichetta campo
nl: Veld label

source: A brief description of the field, to be displayed on the content submission form.
it: Una breve descrizione del campo, da visualizzare nella maschera di inserimento del contenuto.
nl: Een korte beschrijving van het veld. Deze wordt op het formulier om inhoud toe te voegen weergegeven.

source: Required field
it: Campo obbligatorio
nl: Verplicht veld

source: Whether the user must fill in the field when creating content.
it: L'utente deve popolare il campo quando crea un contenuto.
nl: Als de gebruiker verplicht een veld moet invullen om inhoud toe te voegen.

source: Show in teaser
it: Mostra nel teaser

source: Whether this field should be shown as part of the teaser.
it: Questo campo deve essere visualizzato come parte dell'anteprima.

source: Show in table
it: Mostra in tabella

source: Whether this field should be shown as part of this content type's <a href="%table">tabular view</a>.
it: Questo campo deve essere visualizzato come parte della <a href="%table">vista tabulare</a> di questo tipo di contenuto

source: Weight
it: Peso
nl: Gewicht

source: Optional. On the content editing form, the heavier fields will sink and the lighter fields will be positioned nearer the top.
it: Opzionale. Nella maschera di modifica del contenuto, i campi più pesanti saranno gli ultimi e quelli più leggerei saranno posizionati all'inizio.
nl: Optioneel. Hiermee wordt de volgorde op het 'inhouds bewerkings formulier' bepaald. De zwaarste onderaan, de lichtste bovenaan.

source: You must give this field a label.
it: Dovete assegnare un etichetta a questo campo.
nl: U moet dit veld een label geven.

source: updated field "%name".
it: campo "%name" modificato.

source: created new field "%name".
it: nuovo campo "%name" creato.

source: Delete field "%name"
it: Cancella campo "%name"

source: Are you sure you want to delete this field? All data in this field will be lost.
it: Siete sicuri di volere cancellare questo campo ? Tutti i dati in questo campo verrano perso.
nl: Weet u zeker dat u dit veld wilt verwijderen? Alle data in dit veld gaat dan verloren.

source: deleted field "%name".
it: campo "%name" cancellato.

source: feed
it: sorgente

source: calendar
it: calendario

source: week
it: settimana

source: Week view
it: Vista settimanale

source: day
it: giorno

source: Day view
it: Vista giornaliera

source: table
it: tabella

source: Table view
it: Vista tabellare

source: month
it: mese

source: Month view
it: Vista mensile

source: more
it: leggi tutto

source: events
it: eventi

source: add item to calendar
it: aggiungi elemento al calendario

source: filter by content type
it: filtro per tipo di contenuto

source: filter by taxonomy
it: filtro per categorie

source: Event timezone input
it: Immissione fuso orario evento

source: Use the sitewide timezone
it: Usa il fuso orario del sito

source: Use the timezone of the user editing or creating the event
it: Usa il fuso orario dell'utente che modifica o crea un evento

source: Allow users to set event timezones
it: Permette agli utenti di impostare i fusi orari degli eventi

source: Events are saved with a timezone value. This setting allows you to determine how the timezone is determined when creating or editing an event.
it: Gli eventi vengono memorizzati con un valore di fuso orario. Questo parametro permette di determinare come gestire il fuso orario quando si crea o modifica un evento.

source: Event timezone display
it: Mostra il fuso orario dell'evento

source: Use the event's timezone
it: Usa il fuso orario dell'evento

source: Use the user's timezone
it: Usa il fuso orario dell'utente

source: Events are saved with a timezone value. This setting allows you to determine if the event's timezone or the user's personal timezone setting is used to display the time for an event.
it: Gli eventi vengono salvati con un valore di fuso orario, Questo parametro permette di determinare se viene usato il fuso orario dell'evento o quello personale dell'utente per visualizzare l'orario di un evento.

source: site configuration
it: configurazione sito

source: General Event options
it: Opzioni generali eventi

source: Default overview
it: Panoramica predefinita

source: Day
it: Giorno

source: Week
it: Settimana

source: Month
it: Mese

source: Table
it: Tabella

source: The default event view to display when no format is specifically requested. This is also the view that will be displayed from the block calendar links.
it: La vista predefinita da visualizzare quando non viene richiesto un formato specifico. Questa è anche la vista che verrà visualizzata dai link del blocco calendario.

source: Table view default period
it: Periodo predefinito di visualizzazione tabellare

source: The default number of days to display in the table view. You can specify a different number of days in the url. More info on the event url format %link
it: Il numero predefinito di giorni da visualizzare nella vista tabellare. Puoi specificare un numero differente di giorni nell'url. Maggiori informazioni sul formato dell'url eventi %link

source: here
it: qui

source: Show taxonomy filter control on calendar views
it: Mostra controllo filtro categorie nelle viste del calendario

source: Only show taxonomy filter control when taxonomy filter view is requested
it: Mostra controllo filtro per categoria solo quando viene richiesta la vista per categoria

source: Never show taxonomy filter control
it: Non mostrare mai controllo filtro categorie

source: Show content type filter control on calendar views
it: Mostra controllo filtro per tipo contenuto nelle viste del calendario

source: Only show content type filter control when content type filter view is requested
it: Mostra controllo filtro per tipo contenuto solo quando viene richiesta la vista per tipo contenuto

source: Never show content type filter control
it: Non mostrare mai controllo filtro per tipo contenuto

source: Event overview options
it: Panoramica opzioni eventi

source: Events
it: Eventi

source: Filter
it: Filtro

source: No matches found.
it: Nessun dato soddisfa i criteri di ricerca.

source: Search Events
it: Ricerca eventi

source: Mon
it: Lun

source: Tue
it: Mar

source: Wed
it: Mer

source: Thu
it: Gio

source: Fri
it: Ven

source: Sat
it: Sab

source: Sun
it: Dom

source: Select event terms to filter by
it: Seleziona i termini delle categorie da filtrare

source: Select event type to filter by
it: Seleziona il tipo di evento da filtrare

source: Calendar to browse events.
it: Calendario per visualizzazione eventi.

source: List of upcoming events.
it: Lista dei prossimi eventi.

source: List of event taxonomy types.
it: Lista di categorie di eventi.

source: Upcoming events
it: Prossimi eventi

source: More events.
it: Altri eventi.

source: Browse event types
it: Visualizza tipi di contenuto

source: NOW
it: ADESSO

source: Show in event calendar
it: Mostra nel calendario eventi

source: Never
it: Mai

source: All views
it: Tutte le viste

source: Only in views for this type
it: Solo in viste per questo tipo

source: None: This content type will not be associated with the events calendar.<br />All views: This content type will be available for display on all calendar views, including with other events.<br />Only in views for this type: This content type will only appear in calendar views specific to this type and never with other events.
it: Nessuno: Il tipo di contenuto non sarà associato con il calendario eventi.<br />Tutte le viste: Questo tipo di contenuto sarà disponibile per la visualizzazione in tutte le viste calendario, insieme ad altri eventi.<br />Solo in viste per questo tipo: Questo tipo di contenuto apparirà solo in viste calendario specifiche per questo tipo e mai con altri eventi,

source: Start
it: Inizio

source: Start date.
it: Data inizio.

source: End
it: Fine

source: End date.
it: Data di fine.

source: Time zone
it: Fuso orario

source: Select the time zone this event occurs in.
it: Seleziona il fuso orario in cui avviene questo evento.

source: Lets users make events and keep calendars.
it: Permette agli utenti di pubblicare eventi e mantenere un calendario.
